export default [
  {
    text: "نبی کریم ﷺ کا اسمِ مبارک کیا ہے؟",
    options: [
      "عبداللہ",
      "محمد ﷺ",
      "ابوبکر",
      "عثمان"
    ],
    correct: "محمد ﷺ",
  },
  {
    text: "نبی ﷺ کی ولادت کہاں ہوئی؟",
    options: [
      "مدینہ",
      "بدر",
      "طائف",
      "مکہ مکرمہ"
    ],
    correct: "مکہ مکرمہ",
  },
  {
    text: "نبی کریم ﷺ پر وحی سب سے پہلے کہاں نازل ہوئی؟",
    options: [
      "مسجد نبوی",
      "غار حرا",
      "مسجد الحرام",
      "مدینہ"
    ],
    correct: "غار حرا",
  },
  {
    text: "نبی ﷺ کی والدہ کا نام کیا تھا؟",
    options: [
      "عائشہ",
      "آمنہ",
      "صفیہ",
      "فاطمہ"
    ],
    correct: "آمنہ",
  },
  {
    text: "نبی کریم ﷺ کے والد کا نام کیا تھا؟",
    options: [
      "ابوطالب",
      "عبدالمطلب",
      "عبداللہ",
      "ابولہب"
    ],
    correct: "عبداللہ",
  },
  {
    text: "نبی ﷺ نے نبوت کا اعلان کس عمر میں کیا؟",
    options: [
      "30 سال",
      "35 سال",
      "40 سال",
      "45 سال"
    ],
    correct: "40 سال",
  },
  {
    text: "ہجرت کے بعد نبی ﷺ نے کس شہر کو دارالحکومت بنایا؟",
    options: [
      "مکہ",
      "طائف",
      "بدر",
      "مدینہ منورہ"
    ],
    correct: "مدینہ منورہ",
  },
  {
    text: "نبی کریم ﷺ کا مشن کیا تھا؟",
    options: [
      "تجارت کرنا",
      "ظلم پھیلانا",
      "لوگوں کو اللہ کی طرف بلانا",
      "حکومت قائم کرنا"
    ],
    correct: "لوگوں کو اللہ کی طرف بلانا",
  },
  {
    text: "نبی ﷺ کو کون سا لقب مکہ والے دیتے تھے؟",
    options: [
      "سخی",
      "امین و صادق",
      "مجاہد",
      "عالم"
    ],
    correct: "امین و صادق",
  },
  {
    text: "نبی ﷺ کی پہلی وحی میں کون سا لفظ نازل ہوا؟",
    options: [
      "قل",
      "اذهب",
      "اقْرَأْ",
      "سبح"
    ],
    correct: "اقْرَأْ",
  },
  {
    text: "نبی ﷺ کی پہلی زوجہ کا نام کیا تھا؟",
    options: [
      "عائشہ رضی اللہ عنہا",
      "صفیہ رضی اللہ عنہا",
      "خدیجہ رضی اللہ عنہا",
      "حفصہ رضی اللہ عنہا"
    ],
    correct: "خدیجہ رضی اللہ عنہا",
  },
  {
    text: "نبی کریم ﷺ نے کتنے سال مکہ میں تبلیغ کی؟",
    options: [
      "13 سال",
      "10 سال",
      "7 سال",
      "3 سال"
    ],
    correct: "13 سال",
  },
  {
    text: "مدینہ میں نبی ﷺ نے مسلمانوں کے درمیان کیا معاہدہ کیا؟",
    options: [
      "معاہدۂ خیبر",
      "معاہدۂ بدر",
      "معاہدۂ مدینہ",
      "معاہدۂ حنین"
    ],
    correct: "معاہدۂ مدینہ",
  },
  {
    text: "نبی ﷺ کی وفات کہاں ہوئی؟",
    options: [
      "مکہ مکرمہ",
      "مدینہ منورہ",
      "طائف",
      "بدر"
    ],
    correct: "مدینہ منورہ",
  },
  {
    text: "نبی ﷺ نے کتنے حج کیے؟",
    options: [
      "تین",
      "دو",
      "ایک",
      "چار"
    ],
    correct: "ایک",
  }
];
