export default [
  {
    text: "قرآن حکیم کس زبان میں نازل ہوا؟",
    options: [
      "فارسی",
      "عربی",
      "اردو",
      "عبرانی"
    ],
    correct: "عربی",
  },
  {
    text: "قرآن پاک کس پیغمبر پر نازل ہوا؟",
    options: [
      "حضرت عیسیٰ علیہ السلام",
      "حضرت موسیٰ علیہ السلام",
      "حضرت محمد ﷺ",
      "حضرت ابراہیم علیہ السلام"
    ],
    correct: "حضرت محمد ﷺ",
  },
  {
    text: "قرآن حکیم کی سب سے پہلی وحی کا پہلا لفظ کیا تھا؟",
    options: [
      "اقْرَأْ",
      "قُلْ",
      "سَبِّحْ",
      "اذْهَبْ"
    ],
    correct: "اقْرَأْ",
  },
  {
    text: "قرآن مجید کے کل پارے کتنے ہیں؟",
    options: [
      "30",
      "25",
      "27",
      "20"
    ],
    correct: "30",
  },
  {
    text: "قرآن مجید کی سب سے طویل سورۃ کون سی ہے؟",
    options: [
      "سورۃ یٰسین",
      "سورۃ اخلاص",
      "سورۃ البقرہ",
      "سورۃ الفاتحہ"
    ],
    correct: "سورۃ البقرہ",
  },
  {
    text: "قرآن کریم کی پہلی سورۃ کون سی ہے؟",
    options: [
      "سورۃ الفلق",
      "سورۃ الاخلاص",
      "سورۃ الفاتحہ",
      "سورۃ الناس"
    ],
    correct: "سورۃ الفاتحہ",
  },
  {
    text: "قرآن مجید کا پہلا نزول کس غار میں ہوا؟",
    options: [
      "غارِ ثور",
      "غارِ حرا",
      "غارِ بدر",
      "غارِ اُحد"
    ],
    correct: "غارِ حرا",
  },
  {
    text: "قرآن مجید میں سب سے زیادہ بار کس نبی کا ذکر آیا ہے؟",
    options: [
      "حضرت آدم علیہ السلام",
      "حضرت عیسیٰ علیہ السلام",
      "حضرت ابراہیم علیہ السلام",
      "حضرت موسیٰ علیہ السلام"
    ],
    correct: "حضرت موسیٰ علیہ السلام",
  },
  {
    text: "قرآن پاک میں کتنی سورتیں ہیں؟",
    options: [
      "100",
      "114",
      "120",
      "99"
    ],
    correct: "114",
  },
  {
    text: "قرآن مجید میں نماز کا حکم سب سے پہلے کس سورۃ میں آیا؟",
    options: [
      "سورۃ البقرہ",
      "سورۃ المزمل",
      "سورۃ الفاتحہ",
      "سورۃ الفجر"
    ],
    correct: "سورۃ المزمل",
  },
  {
    text: "قرآن حکیم کس کے لیے ہدایت ہے؟",
    options: [
      "عربوں کے لیے",
      "مسلمانوں کے لیے",
      "متقین کے لیے",
      "سب انسانوں کے لیے"
    ],
    correct: "متقین کے لیے",
  },
  {
    text: "قرآن مجید میں سب سے مختصر سورۃ کون سی ہے؟",
    options: [
      "سورۃ کوثر",
      "سورۃ نصر",
      "سورۃ فیل",
      "سورۃ عصر"
    ],
    correct: "سورۃ کوثر",
  },
  {
    text: "قرآن مجید میں سب سے پہلے نازل ہونے والی سورۃ کون سی ہے؟",
    options: [
      "سورۃ الفاتحہ",
      "سورۃ العلق",
      "سورۃ المزمل",
      "سورۃ یٰسین"
    ],
    correct: "سورۃ العلق",
  },
  {
    text: "قرآن پاک کی آخری نازل ہونے والی سورۃ کون سی ہے؟",
    options: [
      "سورۃ الفلق",
      "سورۃ الناس",
      "سورۃ النصر",
      "سورۃ العصر"
    ],
    correct: "سورۃ النصر",
  },
  {
    text: "قرآن کریم کو نازل کرنے والا فرشتہ کون تھا؟",
    options: [
      "حضرت میکائل علیہ السلام",
      "حضرت جبرائیل علیہ السلام",
      "حضرت اسرافیل علیہ السلام",
      "حضرت عزرائیل علیہ السلام"
    ],
    correct: "حضرت جبرائیل علیہ السلام",
  }
];
